nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/sqi/processor/sqi_p32mz2048efh064.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _SQI_P32MZ2048EFH064_H
#define _SQI_P32MZ2048EFH064_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    SQI_ID_0 = _SQI1_BASE_ADDRESS,
    SQI_NUMBER_OF_MODULES = 1

} SQI_MODULE_ID;

typedef enum {

    SQI_XFER_MODE_XIP = 3,
    SQI_XFER_MODE_DMA = 2,
    SQI_XFER_MODE_PIO = 1

} SQI_XFER_MODE;

typedef enum {

    SQI_DATA_MODE_3 = 3,
    SQI_DATA_MODE_0 = 0

} SQI_DATA_MODE;

typedef enum {

    SQI_DATA_FORMAT_LSBF = 1,
    SQI_DATA_FORMAT_MSBF = 0

} SQI_DATA_FORMAT;

typedef enum {

    SQI_DATA_OEN_QUAD = 2,
    SQI_DATA_OEN_DUAL = 1,
    SQI_DATA_OEN_SINGLE = 0

} SQI_DATA_OEN;

typedef enum {

    SQI_CS_OEN_BOTH = 3,
    SQI_CS_OEN_1 = 2,
    SQI_CS_OEN_0 = 1,
    SQI_CS_OEN_NONE = 0

} SQI_CS_OEN;

typedef enum {

    SQI_CMD_RECEIVE = 2,
    SQI_CMD_TRANSMIT = 1,
    SQI_CMD_IDLE = 0

} SQI_XFER_CMD;

typedef enum {

    SQI_LANE_QUAD = 2,
    SQI_LANE_DUAL = 1,
    SQI_LANE_SINGLE = 0

} SQI_LANE_MODE;

typedef enum {

    SQI_CS_1 = 1,
    SQI_CS_0 = 0

} SQI_CS_NUM;

typedef enum {

    CLK_DIV_2048 = 0x400,
    CLK_DIV_1024 = 0x200,
    CLK_DIV_512 = 0x100,
    CLK_DIV_256 = 0x80,
    CLK_DIV_128 = 0x40,
    CLK_DIV_64 = 0x20,
    CLK_DIV_32 = 0x10,
    CLK_DIV_16 = 0x8,
    CLK_DIV_8 = 0x4,
    CLK_DIV_4 = 0x2,
    CLK_DIV_2 = 0x1,
    CLK_DIV_1 = 0x0

} SQI_CLK_DIV;

typedef enum {

    ADDR_BYTES_4 = 4,
    ADDR_BYTES_3 = 3,
    ADDR_BYTES_2 = 2,
    ADDR_BYTES_1 = 1,
    ADDR_BYTES_0 = 0

} SQI_ADDR_BYTES;

typedef enum {

    DUMMY_BYTES_7 = 7,
    DUMMY_BYTES_6 = 6,
    DUMMY_BYTES_5 = 5,
    DUMMY_BYTES_4 = 4,
    DUMMY_BYTES_3 = 3,
    DUMMY_BYTES_2 = 2,
    DUMMY_BYTES_1 = 1,
    DUMMY_BYTES_0 = 0

} SQI_DUMMY_BYTES;

typedef enum {

    MODE_BYTES_3 = 3,
    MODE_BYTES_2 = 2,
    MODE_BYTES_1 = 1,
    MODE_BYTES_0 = 0

} SQI_MODE_BYTES;

typedef enum {

    SQI_DMAERROR = 11,
    SQI_PKTCOMP = 10,
    SQI_BDDONE = 9,
    SQI_CONTHR = 8,
    SQI_CONEMPTY = 7,
    SQI_CONFULL = 6,
    SQI_RXTHR = 5,
    SQI_RXEMPTY = 3,
    SQI_RXFULL = 4,
    SQI_TXTHR = 2,
    SQI_TXEMPTY = 0,
    SQI_TXFULL = 1

} SQI_INTERRUPTS;

typedef enum {

    BD_STATE_DISABLED = 5,
    BD_STATE_DONE = 4,
    BD_STATE_PROCESSING_DATA = 3,
    BD_STATE_BEING_FETCHED = 2,
    BD_STATE_FETCH_REQ_PENDING = 1,
    BD_STATE_IDLE = 0

} SQI_BD_STATE;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/sqi_XIPSDRCommandDDRData_Default.h"
#include "../templates/sqi_XIPDDRMode_Default.h"
#include "../templates/sqi_XIPNumberOfDummyBytes_Default.h"
#include "../templates/sqi_XIPNumberOfAddressBytes_Default.h"
#include "../templates/sqi_XIPReadOpCode_Default.h"
#include "../templates/sqi_XIPLaneMode_Default.h"
#include "../templates/sqi_XIPControlWord1_Default.h"
#include "../templates/sqi_XIPChipSelect_Default.h"
#include "../templates/sqi_XIPModeBytes_Default.h"
#include "../templates/sqi_XIPModeCode_Default.h"
#include "../templates/sqi_XIPControlWord2_Default.h"
#include "../templates/sqi_EnableControl_Default.h"
#include "../templates/sqi_CSOutputEnable_Default.h"
#include "../templates/sqi_DataOutputEnable_Default.h"
#include "../templates/sqi_ConBufferReset_Default.h"
#include "../templates/sqi_RxBufferReset_Default.h"
#include "../templates/sqi_TxBufferReset_Default.h"
#include "../templates/sqi_SoftReset_Default.h"
#include "../templates/sqi_BurstControl_Default.h"
#include "../templates/sqi_HoldPinControl_Default.h"
#include "../templates/sqi_WPPinControl_Default.h"
#include "../templates/sqi_ReceiveLatch_Unsupported.h"
#include "../templates/sqi_DataFormat_Default.h"
#include "../templates/sqi_DataModeControl_Default.h"
#include "../templates/sqi_TransferModeControl_Default.h"
#include "../templates/sqi_ConfigWord_Default.h"
#include "../templates/sqi_StatusCheck_Default.h"
#include "../templates/sqi_DDRMode_Default.h"
#include "../templates/sqi_CSDeassert_Default.h"
#include "../templates/sqi_ChipSelect_Default.h"
#include "../templates/sqi_LaneMode_Default.h"
#include "../templates/sqi_TransferCommand_Default.h"
#include "../templates/sqi_TransferCount_Default.h"
#include "../templates/sqi_ControlWord_Default.h"
#include "../templates/sqi_ClockDivider_Default.h"
#include "../templates/sqi_ClockReady_Default.h"
#include "../templates/sqi_ClockControl_Default.h"
#include "../templates/sqi_RxBufThreshold_Default.h"
#include "../templates/sqi_TxBufThreshold_Default.h"
#include "../templates/sqi_RxBufIntThreshold_Default.h"
#include "../templates/sqi_TxBufIntThreshold_Default.h"
#include "../templates/sqi_InterruptControl_Default.h"
#include "../templates/sqi_InterruptStatus_Default.h"
#include "../templates/sqi_TxData_Default.h"
#include "../templates/sqi_RxData_Default.h"
#include "../templates/sqi_TxBufferFree_Default.h"
#include "../templates/sqi_RxBufferCount_Default.h"
#include "../templates/sqi_ConBufAvailable_Default.h"
#include "../templates/sqi_CommandStatus_Default.h"
#include "../templates/sqi_DataPinStatus_Default.h"
#include "../templates/sqi_RxUnderRun_Default.h"
#include "../templates/sqi_TxOverFlow_Default.h"
#include "../templates/sqi_DMAEnable_Default.h"
#include "../templates/sqi_BDPollingEnable_Default.h"
#include "../templates/sqi_DMABDFetch_Default.h"
#include "../templates/sqi_BDCurrentAddress_Default.h"
#include "../templates/sqi_BDBaseAddress_Default.h"
#include "../templates/sqi_BDProcessState_Default.h"
#include "../templates/sqi_DMAProcessInProgress_Default.h"
#include "../templates/sqi_DMAEngineBusy_Default.h"
#include "../templates/sqi_BDControlWord_Default.h"
#include "../templates/sqi_BDPollCount_Default.h"
#include "../templates/sqi_BDTxState_Default.h"
#include "../templates/sqi_BDTxBufCount_Default.h"
#include "../templates/sqi_BDTxLength_Default.h"
#include "../templates/sqi_BDRxState_Default.h"
#include "../templates/sqi_BDRxBufCount_Default.h"
#include "../templates/sqi_BDRxLength_Default.h"
#include "../templates/sqi_ConBufThreshold_Default.h"
#include "../templates/sqi_InterruptSignalControl_Default.h"
#include "../templates/sqi_TapDelay_Default.h"
#include "../templates/sqi_XIPControlWord3_Default.h"
#include "../templates/sqi_XIPControlWord4_Default.h"

